app/views/pages/_form.html.erb

SELECT "references".* FROM "references"
---
	<div class="field">
		<%= f.label :reference_id %><br /><%= f.select :reference_id, Reference.all.map { |e| [e.name, e.id] } %>