app/views/pages/index.html.erb

<h2>Pages</h2>
<p>There <%= (@pages.count==1)? 'is' : 'are' %> currently <%= pluralize(@pages.count, 'page' ) %>, <%= link_to 'create a new one', new_page_path, :class => :button %></p>
---
SELECT "pages".* FROM "pages" ORDER BY title LIMIT 5 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "pages" LIMIT 10 OFFSET 0) subquery_for_count