app/views/references/index.html.erb

SELECT COUNT(*) FROM "references"
---
<h2>References</h2>
<p>There <%= (@references.count==1)? 'is' : 'are' %> currently <%= pluralize(@references.count, 'reference' ) %>, <%= link_to 'create a new one', new_reference_path, :class => :button %></p>