app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" LIMIT 10 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "pages" LIMIT 10 OFFSET 0) subquery_for_count
---
  def index
    @pages = Page.page(params[:page]).per(10)

INSERT INTO "pages" ("author", "body", "created_at", "email", "reference_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @page = Page.find(params[:id])