app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY title LIMIT 5 OFFSET 0
---
  def index
    # Paginate, showing 5 itesm per page
    @pages = Page.order(:title).page(params[:page]).per(5)