app/controllers/references_controller.rb

SELECT "references".* FROM "references" ORDER BY name LIMIT 5 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "references" LIMIT 5 OFFSET 0) subquery_for_count
---
  def index
    # Paginate, showing 5 itesm per reference
    @references = Reference.order(:name).page(params[:page]).per(5)

INSERT INTO "references" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 13 Feb 2012 10:43:30 UTC +00:00], ["name", "Ask"], ["updated_at", Mon, 13 Feb 2012 10:43:30 UTC +00:00]]
---
  def create
    @reference = Reference.new(params[:reference])
    if @reference.save

SELECT "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @reference = Reference.find(params[:id])

SELECT "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "references" SET "name" = 'Ask Jeeves', "updated_at" = '2012-02-13 10:42:17.656137' WHERE "references"."id" = 4
---
  def update
    @reference = Reference.find(params[:id])
    if @reference.update_attributes(params[:reference])

SELECT "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "references" WHERE "references"."id" = ?  [["id", 4]]
---
  def destroy
    @reference = Reference.find(params[:id])
    @reference.destroy